In [1]:
import pandas as pd
import numpy as np
import sqlite3
conn = sqlite3.connect("zippedData/im.db")
import seaborn as sns

In [2]:
basics = pd.read_sql("""
SELECT primary_title, runtime_minutes, genres
  FROM movie_basics
""", conn)
basics

,primary_title,runtime_minutes,genres
0,Sunghursh,175.0,"Action,Crime,Drama"
1,One Day Before the Rainy Season,114.0,"Biography,Drama"
2,The Other Side of the Wind,122.0,Drama
3,Sabse Bada Sukh,NaN,"Comedy,Drama"
4,The Wandering Soap Opera,80.0,"Comedy,Drama,Fantasy"
...,...,...,...
146139,Kuambil Lagi Hatiku,123.0,Drama
146140,Rodolpho Teóphilo - O Legado de um Pioneiro,NaN,Documentary
146141,Dankyavar Danka,NaN,Comedy
146142,6 Gunn,116.0,None
146143,Chico Albuquerque - Revelações,NaN,Documentary

Looks like the runtime for this dataframe is clean with no values equal to 0 though there are none values.

In [10]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   primary_title    146144 non-null  object
 1   runtime_minutes  114405 non-null  float64
 2   genres           140736 non-null  object
dtypes: float64(1), object(2)
memory usage: 3.3+ MB

In [7]:
basics["runtime_minutes"].value_counts().sort_index()

1.0         17
2.0         44
3.0         84
4.0        130
5.0        184
          ...
5460.0       1
6000.0       1
6017.0       1
14400.0      1
51420.0      1
Name: runtime_minutes, Length: 367, dtype: int64

Same thing for genres. There are none values but no stand in ones.

In [9]:
basics["genres"].value_counts()

Documentary                    32185
Drama                          21486
Comedy                          9177
Horror                          4372
Comedy,Drama                    3519
                               ...
Action,Documentary,Fantasy         1
Action,Animation,History           1
Documentary,Mystery,Romance        1
Biography,Family,Mystery           1
Adult,Horror                       1
Name: genres, Length: 1085, dtype: int64

In [14]:
movie_gross = pd.read_csv('zippedData/tn.movie_budgets.csv', delimiter = ",")
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In our movie gross frame, there are no none values but there are $0 values for domestic gross and worldwide gross so we've removed them.

In [15]:
movie_gross = movie_gross[(movie_gross.domestic_gross != '$0') & (movie_gross.worldwide_gross != '$0')]
movie_gross

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5775,76,"May 26, 2006",Cavite,"$7,000","$70,071","$71,644"
5776,77,"Dec 31, 2004",The Mongol King,"$7,000",$900,$900
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [16]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5234 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5234 non-null   int64
 1   release_date       5234 non-null   object
 2   movie              5234 non-null   object
 3   production_budget  5234 non-null   object
 4   domestic_gross     5234 non-null   object
 5   worldwide_gross    5234 non-null   object
dtypes: int64(1), object(5)
memory usage: 286.2+ KB